# Task 9

## Loan Approval Prediction

## Data Loading

In [1]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split

In [2]:
df = pd.read_csv("loan_data.csv")
df

,Text,Income,Credit_Score,Loan_Amount,DTI_Ratio,Employment_Status,Approval
0,I need a loan to pay for an international vaca...,26556.0,581.0,8314.0,79.26,employed,Rejected
1,I want to make home improvements like installi...,197392.0,389.0,111604.0,22.14,employed,Rejected
2,"I need a loan for home renovation, including a...",44561.0,523.0,34118.0,45.44,employed,Rejected
3,I need funds to buy new furniture and applianc...,190363.0,729.0,118757.0,10.22,unemployed,Rejected
4,I need a loan to start a small business.,61853.0,732.0,19210.0,44.13,employed,Approved
...,...,...,...,...,...,...,...
23995,I need funds to pay for my daughter's college ...,195242.0,817.0,16403.0,24.32,employed,Approved
23996,I need financial assistance to launch my own Y...,150246.0,729.0,101572.0,9.97,employed,Rejected
23997,I need money to open a small bookstore and café.,64571.0,650.0,30533.0,57.35,employed,Rejected
23998,I want to buy a car for my rideshare business ...,115825.0,418.0,89837.0,10.37,unemployed,Rejected
23999,I need financial help to cover maternity and d...,180440.0,769.0,15259.0,15.06,employed,Approved

## Data Exploration

In [3]:
print(f"Number of Rows: {df.shape[0]}\nNumber of Columns: {df.shape[1]}")

Number of Rows: 24000
Number of Columns: 7

In [4]:
df.head(7)

,Text,Income,Credit_Score,Loan_Amount,DTI_Ratio,Employment_Status,Approval
0,I need a loan to pay for an international vaca...,26556.0,581.0,8314.0,79.26,employed,Rejected
1,I want to make home improvements like installi...,197392.0,389.0,111604.0,22.14,employed,Rejected
2,"I need a loan for home renovation, including a...",44561.0,523.0,34118.0,45.44,employed,Rejected
3,I need funds to buy new furniture and applianc...,190363.0,729.0,118757.0,10.22,unemployed,Rejected
4,I need a loan to start a small business.,61853.0,732.0,19210.0,44.13,employed,Approved
5,I need a loan to repair my car after an accident.,108236.0,404.0,50797.0,10.24,employed,Rejected
6,I need financial help to cover maternity and d...,110165.0,570.0,61217.0,7.12,employed,Approved

In [5]:
df.tail(4)

,Text,Income,Credit_Score,Loan_Amount,DTI_Ratio,Employment_Status,Approval
23996,I need financial assistance to launch my own Y...,150246.0,729.0,101572.0,9.97,employed,Rejected
23997,I need money to open a small bookstore and café.,64571.0,650.0,30533.0,57.35,employed,Rejected
23998,I want to buy a car for my rideshare business ...,115825.0,418.0,89837.0,10.37,unemployed,Rejected
23999,I need financial help to cover maternity and d...,180440.0,769.0,15259.0,15.06,employed,Approved

In [6]:
df.describe()

              Income  Credit_Score    Loan_Amount     DTI_Ratio
count   23987.000000  23987.000000   23987.000000  23987.000000
mean   110378.444241    575.710552   44366.892900     34.724713
std     51731.901185    159.230633   34670.330491     32.328230
min     20001.000000    300.000000    1005.000000      2.530000
25%     65615.000000    437.000000   16216.000000     14.510000
50%    110465.000000    575.000000   35215.000000     24.860000
75%    155188.000000    715.000000   65646.500000     41.840000
max    200000.000000    850.000000  158834.000000    246.330000

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24000 entries, 0 to 23999
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Text               24000 non-null  object
 1   Income             23987 non-null  float64
 2   Credit_Score       23987 non-null  float64
 3   Loan_Amount        23987 non-null  float64
 4   DTI_Ratio          23987 non-null  float64
 5   Employment_Status  24000 non-null  object
 6   Approval           24000 non-null  object
dtypes: float64(4), object(3)
memory usage: 1.3+ MB

In [8]:
df.columns

Index(['Text', 'Income', 'Credit_Score', 'Loan_Amount', 'DTI_Ratio',
       'Employment_Status', 'Approval'],
      dtype='object')

In [9]:
for i in df.columns:
    print(i)

Text
Income
Credit_Score
Loan_Amount
DTI_Ratio
Employment_Status
Approval

In [10]:
df.count()

Text                 24000
Income               23987
Credit_Score         23987
Loan_Amount          23987
DTI_Ratio            23987
Employment_Status    24000
Approval             24000
dtype: int64

In [11]:
df['Employment_Status'].unique()

array(['employed', 'unemployed'], dtype=object)

In [12]:
df.nunique()

Text                    70
Income               22445
Credit_Score           551
Loan_Amount          21242
DTI_Ratio             8033
Employment_Status        2
Approval                 2
dtype: int64

In [13]:
df.isnull().sum()

Text                  0
Income               13
Credit_Score         13
Loan_Amount          13
DTI_Ratio            13
Employment_Status     0
Approval              0
dtype: int64

# Task 10

## Data Pre Processing

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24000 entries, 0 to 23999
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Text               24000 non-null  object
 1   Income             23987 non-null  float64
 2   Credit_Score       23987 non-null  float64
 3   Loan_Amount        23987 non-null  float64
 4   DTI_Ratio          23987 non-null  float64
 5   Employment_Status  24000 non-null  object
 6   Approval           24000 non-null  object
dtypes: float64(4), object(3)
memory usage: 1.3+ MB

In [15]:
df.isnull().sum()

Text                  0
Income               13
Credit_Score         13
Loan_Amount          13
DTI_Ratio            13
Employment_Status     0
Approval              0
dtype: int64

### Dealing with Null Values

In [16]:
def fillNaMode(cols):
    for i in cols:
        df[i] = df[i].fillna(df[i].mode()[0])

columns = ['Income', 'Credit_Score','Loan_Amount','DTI_Ratio']
fillNaMode(columns)

In [17]:
df.isnull().sum()

Text                 0
Income               0
Credit_Score         0
Loan_Amount          0
DTI_Ratio            0
Employment_Status    0
Approval             0
dtype: int64

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24000 entries, 0 to 23999
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Text               24000 non-null  object
 1   Income             24000 non-null  float64
 2   Credit_Score       24000 non-null  float64
 3   Loan_Amount        24000 non-null  float64
 4   DTI_Ratio          24000 non-null  float64
 5   Employment_Status  24000 non-null  object
 6   Approval           24000 non-null  object
dtypes: float64(4), object(3)
memory usage: 1.3+ MB

### Dropping Irrelevant Columns

In [19]:
df.drop('Text', axis=1, inplace=True)

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24000 entries, 0 to 23999
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Income             24000 non-null  float64
 1   Credit_Score       24000 non-null  float64
 2   Loan_Amount        24000 non-null  float64
 3   DTI_Ratio          24000 non-null  float64
 4   Employment_Status  24000 non-null  object
 5   Approval           24000 non-null  object
dtypes: float64(4), object(2)
memory usage: 1.1+ MB

In [21]:
def changeFloattoInt64(cols):
    for i in cols:
        df[i] = df[i].astype('int64')

columns = ['Income', 'Credit_Score', 'Loan_Amount', 'DTI_Ratio']
changeFloattoInt64(columns)

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24000 entries, 0 to 23999
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Income             24000 non-null  int64
 1   Credit_Score       24000 non-null  int64
 2   Loan_Amount        24000 non-null  int64
 3   DTI_Ratio          24000 non-null  int64
 4   Employment_Status  24000 non-null  object
 5   Approval           24000 non-null  object
dtypes: int64(4), object(2)
memory usage: 1.1+ MB

In [23]:
df['Employment_Status'].unique()

array(['employed', 'unemployed'], dtype=object)

In [24]:
df_clean = df.copy()

In [25]:
def encodeCols(cols):
    for i in cols:
        temp = pd.DataFrame({i:df[i].unique()})
        data_LE = LabelEncoder()
        data_LE.fit(np.ravel(temp))
        df_clean[i] = data_LE.transform(df[i])

columns = ['Employment_Status', 'Approval']
encodeCols(columns)

In [26]:
df_clean.head()

   Income  Credit_Score  Loan_Amount  DTI_Ratio  Employment_Status  Approval
0   26556           581         8314         79                  0         1
1  197392           389       111604         22                  0         1
2   44561           523        34118         45                  0         1
3  190363           729       118757         10                  1         1
4   61853           732        19210         44                  0         0

In [27]:
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24000 entries, 0 to 23999
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Income             24000 non-null  int64
 1   Credit_Score       24000 non-null  int64
 2   Loan_Amount        24000 non-null  int64
 3   DTI_Ratio          24000 non-null  int64
 4   Employment_Status  24000 non-null  int32
 5   Approval           24000 non-null  int32
dtypes: int32(2), int64(4)
memory usage: 937.6 KB

In [28]:
df_clean.to_csv(r'cleaned-data.csv', index=False, header=True)

In [29]:
df_clean.head(2)

   Income  Credit_Score  Loan_Amount  DTI_Ratio  Employment_Status  Approval
0   26556           581         8314         79                  0         1
1  197392           389       111604         22                  0         1

# Task 11

## Data Splitting / Train-Test Split

In [30]:
X = df_clean.drop(columns=['Approval'])  
y = df_clean['Approval']

trainX, testX, trainY, testY = train_test_split(X, y, test_size=0.2, random_state=42)

In [31]:
trainX.head(2)

       Income  Credit_Score  Loan_Amount  DTI_Ratio  Employment_Status
3572    94985           365        35536         37                  0
16782  182376           369        96588         23                  1

In [32]:
trainY.head(2)

3572     1
16782    1
Name: Approval, dtype: int32

In [33]:
print("TrainX:",trainX.shape)
print("TrainY:",trainY.shape)
print("TestX:",testX.shape)
print("TestY:",testY.shape)

TrainX: (19200, 5)
TrainY: (19200,)
TestX: (4800, 5)
TestY: (4800,)

## Training / Applying Classifier

In [34]:
import pickle
from sklearn.svm import SVC

model_SVC = SVC()
model_SVC.fit(trainX, trainY)

print(model_SVC)

SVC()

In [39]:
with open('svc_model.pkl', 'wb') as f:
    pickle.dump(model_SVC, f)

# Testing & Processing Results

In [40]:
svc_predictions = model_SVC.predict(testX)

In [41]:
print(svc_predictions)

[1 1 1 ... 1 1 1]

## Accuracy Score

In [42]:
from sklearn.metrics import accuracy_score
svc_accuracy = accuracy_score(testY, svc_predictions)

print("-- Model Accuracy: ", end="")
print(round(svc_accuracy,3))

-- Model Accuracy: 0.843